src/cf/InformationRegisters/РежимыРаспознаванияФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>РежимыРаспознаванияФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРежимовРаспознаванияФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыРежимовРаспознаванияФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыРежимовРаспознаванияФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗапросу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/РежимыРаспознаванияФайлов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет обновление регистра с режимами распознавания владельцев.
// Удаляя исключенных владельцев и добавляя новых.
// Для новых владельцев всегда устанавливается режим ПоЗапросу.
//
Процедура ОбновитьРежимРаспознаванияДляВладельцев() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивВладельцев = Новый Массив;
	Для Каждого ТипВладельца Из Метаданные.ОпределяемыеТипы.ВладелецФайлов.Тип.Типы() Цикл
		МассивВладельцев.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца));
	КонецЦикла;
	
	ИменаВладельцев = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивВладельцев, "Имя");
	
	ИдентификаторыВладельцев = Новый Соответствие;
	Для Каждого Владелец Из МассивВладельцев Цикл
		ИмяВладельца = ИменаВладельцев[Владелец];
		Если СтрНачинаетсяС(ИмяВладельца, "Удалить") Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторыВладельцев[Владелец] = Истина;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РежимыРаспознаванияФайлов.Владелец КАК Владелец,
		|	РежимыРаспознаванияФайлов.Режим КАК Режим
		|ИЗ
		|	РегистрСведений.РежимыРаспознаванияФайлов КАК РежимыРаспознаванияФайлов";
	
	ТекущиеРежимы = Запрос.Выполнить().Выгрузить();
	
	РежимыДляЗаписи = СоздатьНаборЗаписей();
	
	ДобавленныеВладельцы = Новый Соответствие;
	
	ЕстьИзменения = Ложь;
	
	Для Каждого СтрокаРежим Из ТекущиеРежимы Цикл
		Если ИдентификаторыВладельцев[СтрокаРежим.Владелец] = Неопределено Тогда
			ЕстьИзменения = Истина;
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(РежимыДляЗаписи.Добавить(), СтрокаРежим);
		ДобавленныеВладельцы[СтрокаРежим.Владелец] = Истина;
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ИдентификаторыВладельцев Цикл
		
		Если ДобавленныеВладельцы[КлючЗначение.Ключ] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = РежимыДляЗаписи.Добавить();
		Запись.Владелец = КлючЗначение.Ключ;
		Запись.Режим = Перечисления.ВариантыРежимовРаспознаванияФайлов.ПоЗапросу;
		
		ЕстьИзменения = Истина;
		
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		РежимыДляЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает режимы распознавания файлов для владельцев.
//
// Возвращаемое значение:
//  Соотвествие
//   * Ключ - ИОМ - идентификатор владельца.
//   * Значение - ПеречислениеСсылка.ВариантыРежимовРаспознаванияФайлов - режим.
//
Функция РежимыРаспознавания() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РежимыРаспознаванияФайлов.Владелец КАК Владелец,
		|	РежимыРаспознаванияФайлов.Режим КАК Режим
		|ИЗ
		|	РегистрСведений.РежимыРаспознаванияФайлов КАК РежимыРаспознаванияФайлов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.Владелец] = Выборка.Режим;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает режим распознования файлов для владельца.
//
// Параметры:
//  Владелец - СправочникСсылка.ИдентификаторыОбъектовМетаданных - ИОМ владельца.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыРежимовРаспознаванияФайлов
//
Функция РежимРаспознаванияФайловВладельца(Владелец) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РежимыРаспознаванияФайлов.Режим КАК Режим
		|ИЗ
		|	РегистрСведений.РежимыРаспознаванияФайлов КАК РежимыРаспознаванияФайлов
		|ГДЕ
		|	РежимыРаспознаванияФайлов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Режим;
	Иначе
		ВызватьИсключение НСтр("ru = 'Для владельца не определен режим распознавания. Выполнение операции приостановлено.'");
	КонецЕсли;
	
КонецФункции

// Записывает в регистр режимы распознавания для владельцев файлов.
//
// Параметры:
//  Режимы - Соответствие - см. РежимыРаспознавания
//
Процедура ЗаписатьРежимыРаспознаванияФайлов(Режимы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Для Каждого РежимДляВладельца Из Режимы Цикл
		Запись = Набор.Добавить();
		Запись.Владелец = РежимДляВладельца.Ключ;
		Запись.Режим = РежимДляВладельца.Значение;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

// Возвращает массив типов владельцев справочника "Файлы", которые не подохдят для автоматического распознавания.
//
// Возвращаемое значение:
//  Массив Из Строка
//
Функция НеподходящиеТипыДляАвтораспознавания() Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("Документ.ВходящееПисьмо");
	МассивТипов.Добавить("Документ.ИсходящееПисьмо");
	МассивТипов.Добавить("Документ.ТранспортныйКонтейнерЭДО");
	МассивТипов.Добавить("Документ.ВыгрузкаВССТУ");
	МассивТипов.Добавить("Справочник.СообщениеЭДОПрисоединенныеФайлы");
	МассивТипов.Добавить("Справочник.ШаблоныВнутреннихДокументов");
	МассивТипов.Добавить("Справочник.ШаблоныВходящихДокументов");
	МассивТипов.Добавить("Справочник.ШаблоныИсходящихДокументов");
	МассивТипов.Добавить("Справочник.ШаблоныПисем");
	МассивТипов.Добавить("Справочник.Должности");
	МассивТипов.Добавить("Справочник.ШаблоныТекстов");
	
	Возврат МассивТипов;
	
КонецФункции

// Обновляет режимы распознавания для заданных владельцев файлов.
//
// Параметры:
//  Режимы - Соответствие Из КлючИЗначение:
//   *Ключ - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//   *Значение - ПеречислениеСсылка.ВариантыРежимовРаспознаванияФайлов
//  ВключатьБизнесЛогику - Булево
//
Процедура ОбновитьРежимыРаспознаванияФайловПоВладельцам(Режимы, ВключатьБизнесЛогику) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого РежимДляВладельца Из Режимы Цикл
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Владелец.Установить(РежимДляВладельца.Ключ);
		Набор.Прочитать();
		
		Если Набор.Количество() Тогда
			
			Набор[0].Режим = РежимДляВладельца.Значение;
			Если ВключатьБизнесЛогику Тогда
				Набор.Записать();
			Иначе
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
